In [1]:
import pandas as pd
import numpy as np

print (pd.__version__)
print (np.__version__)

1.1.3
1.20.2

In [2]:
n_rows = 5 
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows,n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0   8  10  12   5  14
1  10  17   3  11   9
2   2  18   5  13  12
3  13  11   3   3  13
4   9   9  11   1   2

In [3]:
df1 = df.copy(deep=True)
df1 = df.drop([1, 4])
df1

    A   B   C   D   E
0   8  10  12   5  14
2   2  18   5  13  12
3  13  11   3   3  13

In [4]:
df2= df.copy(deep=True)
df2 = df.drop([0, 3])
df2

    A   B   C   D   E
1  10  17   3  11   9
2   2  18   5  13  12
4   9   9  11   1   2

Menggabungkan dua Data Frame

inner = menggabungkan 2 dataframe yang sumbernya harus terdapat pada kedua dataframe tersebut dalam kasus kali ini adalah baris ke 2

In [5]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

   A   B  C   D   E
0  2  18  5  13  12

In [7]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   8  10  12   5  14
1   2  18   5  13  12
2  13  11   3   3  13
3  10  17   3  11   9
4   9   9  11   1   2